study/cases/lbfs_Re800/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
// channel height H = 1 (y in [-0.5, 0.5]), step height 0.5, length 30; inflow on the upper half at x = 0
vertices ((0 -0.5 0) (30 -0.5 0) (30 0 0) (0 0 0) (30 0.5 0) (0 0.5 0)
          (0 -0.5 0.05) (30 -0.5 0.05) (30 0 0.05) (0 0 0.05) (30 0.5 0.05) (0 0.5 0.05));
blocks
(
    hex (0 1 2 3 6 7 8 9) (1200 40 1) simpleGrading (1 1 1)
    hex (3 2 4 5 9 8 10 11) (1200 40 1) simpleGrading (1 1 1)
);
boundary
(
    inlet { type patch; faces ((3 9 11 5)); }
    outlet { type patch; faces ((1 2 8 7) (2 4 10 8)); }
    walls { type wall; faces ((0 6 9 3) (0 1 7 6) (5 11 10 4)); }
    frontAndBack { type empty; faces ((0 3 2 1) (3 5 4 2) (6 7 8 9) (9 8 10 11)); }
);
