study/cases/lbfs_Re800/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
transportModel Newtonian;
nu 0.00125;
